; R2Launcher 多国语言配置文件
; v1.4.80
;

[Default]
lang=0004,7C04,0009,000A,0011,0012
rel=0009
font=Tahoma,8,0

;;; 语言无关 language independent
;bgclr=&HC599FF

; 程序常量
F0000000=installcontrol.msi

[0004]
font=SimSun,9,134
00000000="Chinese Simplified"
00000001="简体中文"

;;;;;;主界面
01000001=81’s Home (版本 {1})
01000101=lang/logo.jpg
01000201=lang/R2Beat.ico

01050110=游戏版本
01060000=语言设置

;;;;;;弹出对话框
0F000001=请关闭其它的单机启动程序,否则会造成冲突!
0F000002=使用FSO组件建立文件失败,请检查系统完整性!
0F000003=名字长度不能超过12字节!
0F000004=打开 {1} 失败!
0F000005=加载文件 rnr_script/music.txt 失败!
0F000007=请打开控制面板->区域与语言选项->高级,安装54936-GB18030代码页,否则无法正常游戏!
0F000008=Winsock 初始化失败,这说明系统被破坏,请修复Winsock LSP!
0F000009=启动游戏失败!
0F00000A=Locale {1} 无效。请打开mghack.cfg文件，删除[EXE]下的Locale项。
0F00000B=写入文件失败！请检查游戏目录的权限，设置成Everyone可写！
0F00000C=加载文件 {1} 失败!
0F00000D=名字不能与NPC重复!
0F00000E=请不要在AppLocale下面运行，否则会出现乱码!
0F000010=无法打开启动器，缺少必要的控件。是否运行控件安装程序？
0F000011=游戏路径 {1} 不能包含非ANSI字符，请去掉外文和符号！

;;;;;;联网模块
10010000=登录设置
10010101=服务器IP:
10010102=&C.启动游戏
10010103=用户名:
10010104=密码:
10010105=服务器端口:
10010106=&R.注册账号

10020000=注册设置
10020101=&S.提交注册
10020103=用户名:
10020104=密码:
10020105=确认密码:
10020106=昵称:
10020107=男
10020108=女
10020109=角色性别：
1002010A=密保邮箱：

10030101=检查更新

1F000001=ID长度不能超过16字节!
1F000002=ID必须由字母或数字组成!
1F000003=连接服务器失败,请重试
1F000004=该ID不存在
1F000005=密码错误
1F000006=网络连接被中断!
1F000007=密码长度不能超过16字节!
1F000008=注册成功
1F000009=ID或昵称已存在!
1F00000A=两次密码不一致!
1F00000B=服务器未开放注册!
1F00000C=未知错误!
1F00000D=字段不能留空!
1F00000E=ID含有非法字符!
1F00000F=登录器需要更新
1F000010=昵称长度不能超过12字节!
1F000011=游戏需要更新！请使用Git拉取即可。你的版本是{1}，服务器的版本是{2}。
1F000012=用户被封禁！封禁到期时间为{1}
1F000013=检测到有新版本{1}，是否下载？
1F000014=没有检测到更新
1F000015=检查更新出错

[7C04]
font=PMingLiU,9,136
rel=0009
00000000="Chinese Traditional"
00000001="繁體中文"

[0404]
rel=7C04
[0804]
rel=0004
[0C04]
rel=0404
[1004]
rel=0804
[1404]
rel=0C04
[7804]
rel=0004

[0009]
00000000="English"
00000001="English"

;;;;;;主界面
01000001=81’s Home (Ver {1})

01050110=Game Version
01060000=Language

;;;;;;弹出对话框
0F000001=Please close other r2single programs to prevent conflicting.
0F000002=Error creating File System Object. Please check your system.
0F000003=The length of name cannot be more than 12 bytes!
0F000004=Failed to open {1}!
0F000005=Error Loading File rnr_script/music.txt !
0F000007=Please open Control Panel -> Region and Language Options -> Advanced, and install codepage 54936-GB18030, otherwise you will experience lots of problems!
0F000008=Winsock initialisation failed! It indicates that your system is broken. Please repair Winsock LSP chain!
0F000009=Start Game failed!
0F00000A=Invalid locale {1}. Please open file mghack.cfg and delete the item "Locale" under [EXE] section.
0F00000B=Failed to write to file! Please check the permissions of the game folder and set to everyone can write.
0F00000C=Error Loading File {1} !
0F00000D=The nickname must be distinct from NPC!
0F00000E=Do not run with AppLocale, otherwise DBCS characters will mangle!
0F000010=Unable to open the launcher. Necessary controls are missing. Do you want to run the controls installer?
0F000011=Game path {1} cannot contain non-ANSI characters. Please remove any strange symbols and characters!

;;;;;;联网模块
10010000=Login Config
10010101=Server IP:
10010102=Start &Client
10010103=Username:
10010104=Password:
10010105=Server Port:
10010106=&Register Account

10020000=Register Config
10020101=&Submit Registration
10020103=Username:
10020104=Password:
10020105=Confirm password:
10020106=Nick:
10020107=Boy
10020108=Girl
10020109=Gender of role:
1002010A=Security Email:

10030101=Check for updates

1F000001=ID length cannot be more than 16 bytes!
1F000002=ID must be alphanumeric!
1F000003=Connecting to server failed. Please retry.
1F000004=ID does not exist.
1F000005=Password error.
1F000006=Connection is lost!
1F000007=Password length cannot be more than 16 bytes!
1F000008=Register success.
1F000009=ID or nickname already exists!
1F00000A=Password and confirm password are not the same!
1F00000B=Server closed registration!
1F00000C=Unknown error!
1F00000D=Fields cannot leave empty!
1F00000E=ID contains invalid characters!
1F00000F=The launcher needs to be updated!
1F000010=Nickname length cannot be more than 12 bytes!
1F000011=The game needs to be updated! Your version is {1}, and the server's version is {2}.
1F000012=The user is banned until {1}
1F000013=Detected new version {1}, download now?
1F000014=There is no update now.
1F000015=Error checking for updates.


[000A]
00000000="Spanish"
00000001="Español"

;;;;;;主界面
01000001=81’s Home (Ver {1})

01050110=Versión del juego
01060000=Idioma

;;;;;;弹出对话框
0F000001=Cierre otros programas de r2single para evitar conflictos.
0F000002=Error al crear el objeto del sistema de archivos Por favor revisa tu sistema.
0F000003=¡La longitud del nombre no puede ser más de 12 bytes!
0F000004=Error al abrir {1}!
0F000005=Error al cargar el archivo rnr_script/music.txt!
0F000007=Abra el Panel de control -> Opciones de región e idioma -> Avanzado, e instale la página de códigos 54936-GB18030, de lo contrario, experimentará muchos problemas.
0F000008=La inicialización de Winsock falló! Indica que su sistema está roto. Por favor, repare la cadena Winsock LSP.
0F000009=¡Juego de inicio fallido!
0F00000A=Configuración regional no válida {1}. Abra el archivo mghack.cfg y elimine el elemento "Configuración regional" en la sección [EXE].
0F00000B=¡No se pudo escribir en el archivo! Verifique los permisos de la carpeta del juego y configúrelo para que todos puedan escribir.
0F00000C=Error al cargar el archivo {1}!
0F00000D=El apodo debe ser distinto de NPC!
0F00000E=No se ejecute con AppLocale, de lo contrario los caracteres DBCS se descompondrán.
0F000010=No se puede abrir el iniciador. Los controles necesarios faltan. ¿Desea ejecutar el instalador de controles?
0F000011=La ruta del juego {1} no puede contener caracteres que no sean ANSI. ¡Por favor, elimine los símbolos y carácters extraños!

;;;;;;联网模块
10010000=Iniciar Sección Configuración
10010101=Servidor IP:
10010102=Inicio &Cliente
10010103=Nombre de usuario:
10010104=Contraseña:
10010105=Puerto de servicio:
10010106=&Registrar Cuenta

10020000=Registro de configuración
10020101=&Enviar registro
10020103=Nombre de usuario:
10020104=Contraseña:
10020105=Confirmar contraseña:
10020106=Nick:
10020107=Chico
10020108=Chica
10020109=Género del rol:
1002010A=Email de seguridad:

10030101=Buscar actualizaciones

1F000001=¡La longitud de ID no puede ser más de 16 bytes!
1F000002=¡La identificación debe ser alfanumérica!
1F000003=La conexión al servidor falló. Por favor, intenta de nuevo.
1F000004=ID no existe.
1F000005=Error de contraseña.
1F000006=La conexión esta perdida!
1F000007=La longitud de la contraseña no puede ser más de 16 bytes.
1F000008=Registro exitoso.
1F000009=ID o apodo ya existe!
1F00000A=La contraseña y la contraseña no son lo mismo.
1F00000B=¡El servidor cerró el registro!
1F00000C=¡Error desconocido!
1F00000D=¡Los campos no pueden dejarse vacíos!
1F00000E=¡ID contiene caracteres inválidos!
1F00000F=¡El iniciador necesita ser actualizado!
1F000010=La longitud del sobrenombre no puede ser más de 12 bytes.
1F000011=¡El juego necesita ser actualizado! Su versión es {1}, y la versión del servidor es {2}.
1F000012=El usuario está prohibido hasta {1}
1F000013=Detectada nueva versión {1}, ¿Descargar ahora?
1F000014=No hay actualización ahora.
1F000015=Error al buscar actualizaciones.


[0011]
font=MS PGothic,9,128
rel=0009
00000000="Japanese"
00000001="日本語"


[0012]
font=Dotum,9,129
rel=0009
00000000="Korean"
00000001="한국어"

